raw-results/azure/azure-gateway-100rps.txt
Running 1m test @ http://127.0.0.1:9080/v1/chat/completions
  4 threads and 100 connections
  Thread calibration: mean lat.: 4029.549ms, rate sampling interval: 11165ms
  Thread calibration: mean lat.: 3939.952ms, rate sampling interval: 10706ms
  Thread calibration: mean lat.: 4098.901ms, rate sampling interval: 11321ms
  Thread calibration: mean lat.: 3908.324ms, rate sampling interval: 10936ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.90s     4.87s   28.51s    65.74%
    Req/Sec    15.62      2.00    19.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.66s 
 75.000%   19.61s 
 90.000%   21.53s 
 99.000%   25.99s 
 99.900%   27.90s 
 99.990%   28.52s 
 99.999%   28.52s 
100.000%   28.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1826.815     0.000000            1         1.00
    8470.527     0.100000          417         1.11
   11214.847     0.200000          832         1.25
   13410.303     0.300000         1248         1.43
   15130.623     0.400000         1664         1.67
   16662.527     0.500000         2080         2.00
   17301.503     0.550000         2288         2.22
   17956.863     0.600000         2498         2.50
   18579.455     0.650000         2710         2.86
   19087.359     0.700000         2913         3.33
   19611.647     0.750000         3124         4.00
   19890.175     0.775000         3224         4.44
   20185.087     0.800000         3330         5.00
   20496.383     0.825000         3434         5.71
   20791.295     0.850000         3538         6.67
   21118.975     0.875000         3638         8.00
   21331.967     0.887500         3692         8.89
   21528.575     0.900000         3747        10.00
   21757.951     0.912500         3798        11.43
   21954.559     0.925000         3846        13.33
   22331.391     0.937500         3902        16.00
   22462.463     0.943750         3925        17.78
   22659.071     0.950000         3952        20.00
   22904.831     0.956250         3977        22.86
   23248.895     0.962500         4002        26.67
   23592.959     0.968750         4028        32.00
   23789.567     0.971875         4041        35.56
   24100.863     0.975000         4055        40.00
   24494.079     0.978125         4067        45.71
   24739.839     0.981250         4080        53.33
   25149.439     0.984375         4093        64.00
   25395.199     0.985938         4100        71.11
   25591.807     0.987500         4106        80.00
   25788.415     0.989062         4112        91.43
   26116.095     0.990625         4119       106.67
   26345.471     0.992188         4125       128.00
   26443.775     0.992969         4128       142.22
   26836.991     0.993750         4132       160.00
   26853.375     0.994531         4135       182.86
   27000.831     0.995313         4138       213.33
   27131.903     0.996094         4141       256.00
   27262.975     0.996484         4143       284.44
   27394.047     0.996875         4146       320.00
   27394.047     0.997266         4146       365.71
   27639.807     0.997656         4148       426.67
   27656.191     0.998047         4149       512.00
   27672.575     0.998242         4150       568.89
   27688.959     0.998437         4151       640.00
   27787.263     0.998633         4152       731.43
   27901.951     0.998828         4153       853.33
   27901.951     0.999023         4153      1024.00
   27967.487     0.999121         4154      1137.78
   27967.487     0.999219         4154      1280.00
   28180.479     0.999316         4155      1462.86
   28180.479     0.999414         4155      1706.67
   28180.479     0.999512         4155      2048.00
   28426.239     0.999561         4156      2275.56
   28426.239     0.999609         4156      2560.00
   28426.239     0.999658         4156      2925.71
   28426.239     0.999707         4156      3413.33
   28426.239     0.999756         4156      4096.00
   28524.543     0.999780         4157      4551.11
   28524.543     1.000000         4157          inf
#[Mean    =    15901.728, StdDeviation   =     4867.295]
#[Max     =    28508.160, Total count    =         4157]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4639 requests in 1.00m, 4.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 202
  Non-2xx or 3xx responses: 1066
Requests/sec:     77.30
Transfer/sec:     70.26KB