raw-results/azure/azure-gateway-35rps.txt
Running 1m test @ http://127.0.0.1:9080/v1/chat/completions
  4 threads and 35 connections
  Thread calibration: mean lat.: 3547.498ms, rate sampling interval: 11042ms
  Thread calibration: mean lat.: 3238.344ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 3343.530ms, rate sampling interval: 10076ms
  Thread calibration: mean lat.: 3352.168ms, rate sampling interval: 9773ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.52s     6.12s   30.20s    60.53%
    Req/Sec     4.39      0.49     5.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.40s 
 75.000%   21.53s 
 90.000%   24.89s 
 99.000%   28.33s 
 99.900%   29.02s 
 99.990%   30.21s 
 99.999%   30.21s 
100.000%   30.21s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4927.487     0.000000            1         1.00
    8179.711     0.100000           99         1.11
   10436.607     0.200000          198         1.25
   12566.527     0.300000          298         1.43
   14532.607     0.400000          396         1.67
   16400.383     0.500000          494         2.00
   17399.807     0.550000          544         2.22
   18284.543     0.600000          594         2.50
   19464.191     0.650000          643         2.86
   20496.383     0.700000          694         3.33
   21528.575     0.750000          742         4.00
   22052.863     0.775000          768         4.44
   22577.151     0.800000          792         5.00
   23085.055     0.825000          816         5.71
   23674.879     0.850000          840         6.67
   24313.855     0.875000          866         8.00
   24641.535     0.887500          880         8.89
   24903.679     0.900000          892        10.00
   25182.207     0.912500          902        11.43
   25559.039     0.925000          914        13.33
   25935.871     0.937500          927        16.00
   26279.935     0.943750          934        17.78
   26542.079     0.950000          939        20.00
   26705.919     0.956250          945        22.86
   27017.215     0.962500          951        26.67
   27312.127     0.968750          959        32.00
   27475.967     0.971875          961        35.56
   27607.039     0.975000          964        40.00
   27672.575     0.978125          967        45.71
   27787.263     0.981250          970        53.33
   27885.567     0.984375          973        64.00
   27983.871     0.985938          975        71.11
   28229.631     0.987500          976        80.00
   28327.935     0.989062          978        91.43
   28344.319     0.990625          980       106.67
   28409.855     0.992188          981       128.00
   28491.775     0.992969          982       142.22
   28491.775     0.993750          982       160.00
   28557.311     0.994531          983       182.86
   28655.615     0.995313          984       213.33
   28917.759     0.996094          985       256.00
   28917.759     0.996484          985       284.44
   28917.759     0.996875          985       320.00
   28934.143     0.997266          986       365.71
   28934.143     0.997656          986       426.67
   29016.063     0.998047          987       512.00
   29016.063     0.998242          987       568.89
   29016.063     0.998437          987       640.00
   29016.063     0.998633          987       731.43
   29016.063     0.998828          987       853.33
   30212.095     0.999023          988      1024.00
   30212.095     1.000000          988          inf
#[Mean    =    16520.426, StdDeviation   =     6118.129]
#[Max     =    30195.712, Total count    =          988]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1161 requests in 1.00m, 1.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 51
Requests/sec:     19.33
Transfer/sec:     20.47KB