raw-results/azure/azure-gateway-60rps.txt
Running 1m test @ http://127.0.0.1:9080/v1/chat/completions
  4 threads and 60 connections
  Thread calibration: mean lat.: 2931.210ms, rate sampling interval: 8257ms
  Thread calibration: mean lat.: 2808.383ms, rate sampling interval: 7704ms
  Thread calibration: mean lat.: 2865.168ms, rate sampling interval: 7569ms
  Thread calibration: mean lat.: 2960.834ms, rate sampling interval: 8519ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.12s     4.65s   22.94s    59.45%
    Req/Sec     9.87      0.95    11.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.41s 
 75.000%   14.92s 
 90.000%   17.81s 
 99.000%   20.87s 
 99.900%   22.12s 
 99.990%   22.95s 
 99.999%   22.95s 
100.000%   22.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3524.607     0.000000            1         1.00
    5464.063     0.100000          205         1.11
    6438.911     0.200000          410         1.25
    7516.159     0.300000          613         1.43
    8830.975     0.400000          818         1.67
   10412.031     0.500000         1021         2.00
   11362.303     0.550000         1124         2.22
   12476.415     0.600000         1226         2.50
   13385.727     0.650000         1328         2.86
   14147.583     0.700000         1431         3.33
   14917.631     0.750000         1532         4.00
   15376.383     0.775000         1583         4.44
   15835.135     0.800000         1634         5.00
   16252.927     0.825000         1685         5.71
   16793.599     0.850000         1737         6.67
   17317.887     0.875000         1788         8.00
   17498.111     0.887500         1813         8.89
   17809.407     0.900000         1838        10.00
   18104.319     0.912500         1864        11.43
   18350.079     0.925000         1890        13.33
   18743.295     0.937500         1917        16.00
   18923.519     0.943750         1930        17.78
   19054.591     0.950000         1940        20.00
   19202.047     0.956250         1953        22.86
   19415.039     0.962500         1966        26.67
   19595.263     0.968750         1980        32.00
   19693.567     0.971875         1987        35.56
   19791.871     0.975000         1992        40.00
   19890.175     0.978125         1998        45.71
   20054.015     0.981250         2004        53.33
   20348.927     0.984375         2011        64.00
   20463.615     0.985938         2014        71.11
   20627.455     0.987500         2017        80.00
   20725.759     0.989062         2021        91.43
   20922.367     0.990625         2023       106.67
   21053.439     0.992188         2027       128.00
   21118.975     0.992969         2030       142.22
   21118.975     0.993750         2030       160.00
   21135.359     0.994531         2031       182.86
   21266.431     0.995313         2033       213.33
   21495.807     0.996094         2035       256.00
   21495.807     0.996484         2035       284.44
   21594.111     0.996875         2036       320.00
   21659.647     0.997266         2037       365.71
   21676.031     0.997656         2038       426.67
   21823.487     0.998047         2039       512.00
   21823.487     0.998242         2039       568.89
   21823.487     0.998437         2039       640.00
   22118.399     0.998633         2040       731.43
   22118.399     0.998828         2040       853.33
   22593.535     0.999023         2041      1024.00
   22593.535     0.999121         2041      1137.78
   22593.535     0.999219         2041      1280.00
   22593.535     0.999316         2041      1462.86
   22593.535     0.999414         2041      1706.67
   22953.983     0.999512         2042      2048.00
   22953.983     1.000000         2042          inf
#[Mean    =    11116.587, StdDeviation   =     4649.987]
#[Max     =    22937.600, Total count    =         2042]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2423 requests in 1.00m, 2.50MB read
  Socket errors: connect 0, read 0, write 0, timeout 47
  Non-2xx or 3xx responses: 1
Requests/sec:     40.33
Transfer/sec:     42.68KB